refactor: refatora estrutura do projeto, simplifica implementações, adiciona comentário explicativos para estudo
